In [ ]:
#cONCAT two df or series based on index. Therefore, index must be align to get the correct output.
#Merge function auto allocation index .That is better than concat

In [1]:
import pandas as pd
import numpy as np

In [10]:
data1={
    "City":["Karachi","Lahore","Italy"],
    "Temp":[34,22,65],
   
}
data2={
    "City":["Karachi","Lahore","Italy"],
    "Humidity":[19,20,21],
}

In [11]:
df1=pd.DataFrame(data1)
df1

      City  Temp
0  Karachi    34
1   Lahore    22
2    Italy    65

In [12]:
df2=pd.DataFrame(data2)
df2

      City  Humidity
0  Karachi        19
1   Lahore        20
2    Italy        21

In [14]:
pd.concat([df1,df2])

      City  Temp  Humidity
0  Karachi  34.0       NaN
1   Lahore  22.0       NaN
2    Italy  65.0       NaN
0  Karachi   NaN      19.0
1   Lahore   NaN      20.0
2    Italy   NaN      21.0

In [15]:
pd.concat([df1,df2], ignore_index=True)  #It will igrnore index

      City  Temp  Humidity
0  Karachi  34.0       NaN
1   Lahore  22.0       NaN
2    Italy  65.0       NaN
3  Karachi   NaN      19.0
4   Lahore   NaN      20.0
5    Italy   NaN      21.0

In [20]:
#If you provide keys then to dataframe will have own key. You can use that key to manipulate data. 
# key will act as index .Therefore you can use it with loc
f=pd.concat([df1,df2],keys=["citya","cityb"] )
f

            City  Temp  Humidity
citya 0  Karachi  34.0       NaN
      1   Lahore  22.0       NaN
      2    Italy  65.0       NaN
cityb 0  Karachi   NaN      19.0
      1   Lahore   NaN      20.0
      2    Italy   NaN      21.0

In [29]:
f.loc["citya"]

      City  Temp  Humidity
0  Karachi  34.0       NaN
1   Lahore  22.0       NaN
2    Italy  65.0       NaN

# Horz concat

In [31]:
pd.concat([df1,df2], axis=1)  #It will igrnore index
#be way of index, it will simply concat both df, will not auto adjust axis

      City  Temp     City  Humidity
0  Karachi    34  Karachi        19
1   Lahore    22   Lahore        20
2    Italy    65    Italy        21

In [41]:
data1={
    "City":["Lahore","Karachi","Italy"],
    "Temp":[34,22,65],
   
}
data2={
    "City":["Karachi","Lahore","Italy"],
    "Humidity":[19,20,21],
}
df1=pd.DataFrame(data1)
df1
df2=pd.DataFrame(data2)
df2

      City  Humidity
0  Karachi        19
1   Lahore        20
2    Italy        21

In [42]:
pd.concat([df1,df2], axis=1)  #it just concat , but value is change.

      City  Temp     City  Humidity
0   Lahore    34  Karachi        19
1  Karachi    22   Lahore        20
2    Italy    65    Italy        21

In [44]:
#This problem cannot be solve with concat function if the original dataframe is changed , it will conact as original
# you can only change original dataframe
data1={
    "City":["Lahore","Karachi","Italy"],
    "Temp":[34,22,65],
   
}
data2={
    "City":["Karachi","Lahore","Italy"],
    "Humidity":[19,20,21],
}
df1=pd.DataFrame(data1)
df1
df2=pd.DataFrame(data2, index=[1,0,2])##This line mapping index to other dataframe so concat willl be good
df2

      City  Humidity
1  Karachi        19
0   Lahore        20
2    Italy        21

In [45]:
pd.concat([df1,df2], axis=1)   #Now it will be ok. because we align the index while creating dataframe

      City  Temp     City  Humidity
0   Lahore    34   Lahore        20
1  Karachi    22  Karachi        19
2    Italy    65    Italy        21

# concation only one column or series

In [48]:
df1

      City  Temp
0   Lahore    34
1  Karachi    22
2    Italy    65

In [49]:
df2

      City  Humidity
1  Karachi        19
0   Lahore        20
2    Italy        21

In [50]:
humidity=df2['Humidity']

In [55]:
final=pd.concat([df1,humidity], axis=1)

In [56]:
final

      City  Temp  Humidity
0   Lahore    34        20
1  Karachi    22        19
2    Italy    65        21